app/controllers/images_controller.rb

INSERT INTO `images` (`path`, `created_at`, `updated_at`) VALUES ('1458450941/PA160188.JPG', '2016-03-20 05:15:41', '2016-03-20 05:15:41')
---
  def upload
    if(params[:image])
      @image = Image.new(file: params[:image][:file])
    else
      @image = Image.new
    end
    if @image.save

SELECT  `images`.* FROM `images`  ORDER BY `images`.`created_at` ASC, `images`.`desc` ASC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `images`
---
  def list
    @images = Image.order("created_at DESC").page params[:page]